@fmunozmiranda  appears to be a slightly different error now on the create vs the secondary apply 

```
ink@LTWXCGVT333:~/dev/meraki-terraform-test $ terraform apply
data.meraki_networks.dev_networks: Reading...
meraki_devices_appliance_uplinks_settings.this: Refreshing state...
data.meraki_networks.dev_networks: Read complete after 1s
meraki_networks_appliance_firewall_firewalled_services.this_snmp: Refreshing state...
meraki_networks_appliance_firewall_firewalled_services.this_icmp: Refreshing state...
meraki_networks_appliance_vlans_settings.this_vlans: Refreshing state...
meraki_networks_syslog_servers.this_spoke: Refreshing state...
meraki_networks_appliance_firewall_settings.this: Refreshing state...
meraki_networks_appliance_connectivity_monitoring_destinations.this: Refreshing state...
meraki_networks_traffic_analysis.this_spoke: Refreshing state...
meraki_networks_snmp.this: Refreshing state...
meraki_networks_switch_access_policies.this_site_access_policy: Refreshing state... [name=dot1x/mab]
meraki_networks_appliance_firewall_firewalled_services.this_web: Refreshing state...
meraki_networks_appliance_vlans.this_vlan_20: Refreshing state... [id=20]
meraki_networks_appliance_vlans.this_vlan_1: Refreshing state... [id=1]
meraki_networks_appliance_vlans.this_vlan_5: Refreshing state... [id=5]
meraki_networks_appliance_vlans.this_vlan_2: Refreshing state... [id=2]
meraki_networks_appliance_vlans.this_vlan_30: Refreshing state... [id=30]
meraki_networks_appliance_vlans.this_vlan_10: Refreshing state... [id=10]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # meraki_devices.this_ms_ext_sw1 will be created
  + resource "meraki_devices" "this_ms_ext_sw1" {
      + address           = "750 Park St, Des Moines, IA 50362"
      + details           = (known after apply)
      + firmware          = (known after apply)
      + floor_plan_id     = (known after apply)
      + imei              = (known after apply)
      + lan_ip            = (known after apply)
      + lat               = (known after apply)
      + lng               = (known after apply)
      + mac               = (known after apply)
      + model             = (known after apply)
      + move_map_marker   = true
      + name              = "750-comm-meraki-lab-ext-sw1"
      + network_id        = (known after apply)
      + notes             = (known after apply)
      + product_type      = (known after apply)
      + serial            = "Q2AX-DHBJ-GKBM"
      + switch_profile_id = (known after apply)
      + tags              = (known after apply)
    }

  # meraki_devices.this_ms_sw1 will be created
  + resource "meraki_devices" "this_ms_sw1" {
      + address           = "750 Park St, Des Moines, IA 50362"
      + details           = (known after apply)
      + firmware          = (known after apply)
      + floor_plan_id     = (known after apply)
      + imei              = (known after apply)
      + lan_ip            = (known after apply)
      + lat               = (known after apply)
      + lng               = (known after apply)
      + mac               = (known after apply)
      + model             = (known after apply)
      + move_map_marker   = true
      + name              = "750-comm-meraki-lab-sw1"
      + network_id        = (known after apply)
      + notes             = (known after apply)
      + product_type      = (known after apply)
      + serial            = "Q3EF-4ZH2-9BRF"
      + switch_profile_id = (known after apply)
      + tags              = (known after apply)
    }

  # meraki_devices.this_ms_sw2 will be created
  + resource "meraki_devices" "this_ms_sw2" {
      + address           = "750 Park St, Des Moines, IA 50362"
      + details           = (known after apply)
      + firmware          = (known after apply)
      + floor_plan_id     = (known after apply)
      + imei              = (known after apply)
      + lan_ip            = (known after apply)
      + lat               = (known after apply)
      + lng               = (known after apply)
      + mac               = (known after apply)
      + model             = (known after apply)
      + move_map_marker   = true
      + name              = "750-comm-meraki-lab-sw2"
      + network_id        = (known after apply)
      + notes             = (known after apply)
      + product_type      = (known after apply)
      + serial            = "Q3EF-3BFB-NBF2"
      + switch_profile_id = (known after apply)
      + tags              = (known after apply)
    }

  # meraki_networks_switch_access_policies.this_site_access_policy will be updated in-place
  ~ resource "meraki_networks_switch_access_policies" "this_site_access_policy" {
      ~ guest_port_bouncing                = true -> false
        name                               = "dot1x/mab"
      ~ radius_group_attribute             = "11" -> ""
        # (17 unchanged attributes hidden)
    }

  # meraki_networks_switch_stacks.this_ms_stack will be created
  + resource "meraki_networks_switch_stacks" "this_ms_stack" {
      + id         = (known after apply)
      + name       = "750-comm-meraki-lab-sw-stack"
      + network_id = "L_783626335162467749"
      + serials    = [
          + "Q3EF-3BFB-NBF2",
          + "Q3EF-4ZH2-9BRF",
        ]
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

meraki_networks_switch_stacks.this_ms_stack: Creating...
meraki_devices.this_ms_sw1: Creating...
meraki_devices.this_ms_sw2: Creating...
meraki_devices.this_ms_ext_sw1: Creating...
meraki_networks_switch_access_policies.this_site_access_policy: Modifying... [name=dot1x/mab]
meraki_networks_switch_access_policies.this_site_access_policy: Modifications complete after 0s [name=dot1x/mab]
meraki_devices.this_ms_sw2: Creation complete after 3s [name=750-comm-meraki-lab-sw2]
meraki_devices.this_ms_sw1: Creation complete after 3s [name=750-comm-meraki-lab-sw1]
meraki_devices.this_ms_ext_sw1: Creation complete after 3s [name=750-comm-meraki-lab-ext-sw1]
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to meraki_networks_switch_stacks.this_ms_stack, provider "provider[\"registry.terraform.io/cisco-open/meraki\"]" produced an unexpected new value: .switch_stack_id: was null, but now
│ cty.StringVal("783626335162467039").
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```